Tsung Results/Test2-SinglePassenger-M3-20151103-0324/simple.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
    <server host="54.172.135.35" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="60" unit="second">
    	<users arrivalrate="2" unit="second"/>
    </arrivalphase>
    <arrivalphase phase="2" duration="1" unit="minute">
    	<users interarrival="2" unit="second"/>
    </arrivalphase>
   <arrivalphase phase="3" duration="100" unit="second">
    	<users arrivalrate="3" unit="second"/>
   </arrivalphase>
   <arrivalphase phase="4" duration="150" unit="second">
    	<users interarrival="1" unit="second"/>
   </arrivalphase>
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="view-welcome-page-and-then-sign-up" weight="2" type="ts_http">
      <request>
        <http url="/" version="1.1" method="GET"/>
      </request>
      <request>
	<http url="/users/sign_up" version="1.1" method="GET"/>
      </request>
      <request>
  	<dyn_variable name="authenticity_token"/>
	<dyn_variable name="utf8"/>
  	<http url="/users/sign_up" method="GET" version="1.1"/>
       </request>
       <request>
	<http url="/users" version="1.1" contents="utf8=%%_utf8%%;authenticity_token=%%_authenticity_token%%;user_email=abcd@xyz.com;user_password=11111111;user_password_confirmation=11111111" content_type="application/x-www-form-urlencoded" method="POST">
	</http>
      </request>
    </session>
   <session name="view-welcome-page" weight="1" type="ts_http">
      <request>
	<http url="/" version="1.1" method="GET"/>
      </request>
   </session>
  </sessions>
</tsung>